In [3]:
import pandas as pd

# pandas获取groupby分组里最大值所在的行

In [3]:
df = pd.DataFrame({'Sp':['a','b','c','d','e','f'], 'Mt':['s1', 's1', 's2','s2','s2','s3'], 'Value':[1,2,3,4,5,6], 'Count':[3,2,5,10,10,6]})

In [4]:
df

   Count  Mt Sp  Value
0      3  s1  a      1
1      2  s1  b      2
2      5  s2  c      3
3     10  s2  d      4
4     10  s2  e      5
5      6  s3  f      6

## 方法1 使用apply

In [5]:
df.groupby(['Mt']).apply(lambda x: x[x.Count == x.Count.max()])

      Count  Mt Sp  Value
Mt
s1 0      3  s1  a      1
s2 3     10  s2  d      4
   4     10  s2  e      5
s3 5      6  s3  f      6

## 方法2 使用transform

In [9]:
idx = df.groupby(['Mt']).Count.transform(max) == df.Count

In [11]:
df[idx]

   Count  Mt Sp  Value
0      3  s1  a      1
3     10  s2  d      4
4     10  s2  e      5
5      6  s3  f      6

## 方法３使用idmax
- 上面的方法都有个问题是3、4行的值都是最大值，这样返回了多行，如果只要返回一行呢？

In [17]:
idx=df.groupby(['Mt']).Count.idxmax()

In [18]:
df.iloc[idx]

   Count  Mt Sp  Value
0      3  s1  a      1
3     10  s2  d      4
5      6  s3  f      6

## 方法4 先排序然后取每组第一个

In [22]:
df.sort_values('Count', ascending=False).groupby('Mt', as_index=False).first()

   Mt  Count Sp  Value
0  s1      3  a      1
1  s2     10  d      4
2  s3      6  f      6

# pandas选取指定索引的行

In [9]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8],[23,24,25,26]],columns=['a','b','c','d'])
df

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2  23  24  25  26

In [10]:
# 选取index为1,2的行
df.loc[[1,2]]

    a   b   c   d
1   5   6   7   8
2  23  24  25  26

# pandas中的rank

- rank方法可以用在DataFrame和Series中 表示对数据进行排序 并返回排序后的序号
- 排序默认为升序 可指定ascending=False表示降序

In [1]:
a={'name': ['andy','yolk','bob','tom','guilichao'], 'chinese': [90,87,62,55,109],'math':[34,12,45,67,120]}

In [5]:
b=pd.DataFrame(a).set_index(['name'])

In [6]:
b

           chinese  math
name
andy            90    34
yolk            87    12
bob             62    45
tom             55    67
guilichao      109   120

In [8]:
b.rank(ascending=False)

           chinese  math
name
andy           2.0   4.0
yolk           3.0   5.0
bob            4.0   3.0
tom            5.0   2.0
guilichao      1.0   1.0

# dict -> Frame

 - dict的键对应于frame中的columns dict的值对应于row
 - 如果dict的value也是dict，则内层的dict的key会变成frame的index

In [9]:
a={'name': ['andy','yolk','bob','tom','guilichao'], 'chinese': [90,87,62,55,109],'math':[34,12,45,67,120]}

In [12]:
b=pd.DataFrame(a)

In [13]:
b.head(3)

   chinese  math  name
0       90    34  andy
1       87    12  yolk
2       62    45   bob

In [14]:
b.to_dict()

{'chinese': {0: 90, 1: 87, 2: 62, 3: 55, 4: 109},
 'math': {0: 34, 1: 12, 2: 45, 3: 67, 4: 120},
 'name': {0: 'andy', 1: 'yolk', 2: 'bob', 3: 'tom', 4: 'guilichao'}}

In [15]:
a={'gui':{'sex':'m', 'age':12}, 'jia':{'sex':'f','age':'10'}}

In [16]:
pd.DataFrame(a)

    gui jia
age  12  10
sex   m   f